### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [2]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [3]:
purchase_data["SN"].nunique()

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [4]:
number_of_unique_items=purchase_data["Item Name"].nunique()
number_of_unique_items

179

In [5]:
average_price=purchase_data["Price"].mean()
average_price

3.050987179487176

In [6]:
number_of_purchase=purchase_data["Purchase ID"].count()
number_of_purchase

780

In [7]:
total_revenue=purchase_data["Price"].sum()
total_revenue

2379.77

In [8]:
summary_purchase_df=pd.DataFrame({"Number_of_Unique_Items" : number_of_unique_items,
                                  "Average_Price" : [average_price],
                                  "Number_of_Purchase": [number_of_purchase],
                                  "Total_Revenue": [total_revenue]})
summary_purchase_df['Total_Revenue'] = summary_purchase_df['Total_Revenue'].map("${:,.2f}".format)
summary_purchase_df['Average_Price'] = summary_purchase_df['Average_Price'].map("${:,.2f}".format)

In [9]:
summary_purchase_df.head()

   Number_of_Unique_Items Average_Price  Number_of_Purchase Total_Revenue
0                     179         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [10]:
purchase_data.head(1)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53

In [11]:
purchase_data["Gender"].value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [12]:
male_player_count_df=purchase_data.loc[purchase_data["Gender"]=="Male"]

In [13]:
male_player_count=len(male_player_count_df["Gender"])

In [14]:
male_player_count

652

In [15]:
male_percent=((male_player_count/purchase_data["Gender"].count())*100).round(2)

In [16]:
male_percent

83.59

FEMALE

In [17]:
female_player_count_df=purchase_data.loc[purchase_data["Gender"]=="Female"]

In [18]:
female_player_count=len(female_player_count_df["Gender"])

In [19]:
female_player_count

113

In [20]:
female_percent=((female_player_count/purchase_data["Gender"].count())*100).round(2)

In [21]:
female_percent

14.49

Other / Non-Disclosed

In [22]:
other_player_count_df=purchase_data.loc[purchase_data["Gender"]=="Other / Non-Disclosed"]

In [23]:
other_player_count=len(other_player_count_df["Gender"])

In [24]:
other_player_count

15

In [25]:
other_percent=((other_player_count/purchase_data["Gender"].count())*100).round(2)

In [26]:
other_percent

1.92

In [27]:
total_gender_df=pd.DataFrame({"Gender": ["Male", "Female", "Other / Non-Disclosed"],
                             "Count": [male_player_count, female_player_count, other_player_count],
                             "% Count": [male_percent, female_percent, other_percent]})
total_gender_df['% Count'] = total_gender_df['% Count'].map("{:,.2f}%".format)

In [28]:
total_gender_df

                  Gender  Count % Count
0                   Male    652  83.59%
1                 Female    113  14.49%
2  Other / Non-Disclosed     15   1.92%

In [29]:
cleaner_gender_df=total_gender_df.set_index("Gender")

In [30]:
cleaner_gender_df

                       Count % Count
Gender
Male                     652  83.59%
Female                   113  14.49%
Other / Non-Disclosed     15   1.92%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [31]:
groupby_purchase_data_df=purchase_data.groupby(["Gender"])

In [32]:
purchase_data.head(3)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88

In [33]:
groupby_purchase_data_df.count()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [51]:
new_groupby_purchase_data_df=pd.DataFrame(groupby_purchase_data_df["Price"].mean())

In [52]:
new_groupby_purchase_data_df["Price"].mean()

3.188953870097905

In [53]:
new_groupby_purchase_data_df

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [54]:
total_count=pd.DataFrame(groupby_purchase_data_df["Purchase ID"].count())

In [55]:
new_groupby_purchase_data_df["Purchase Count"]=total_count

In [56]:
new_groupby_purchase_data_df

                          Price  Purchase Count
Gender
Female                 3.203009             113
Male                   3.017853             652
Other / Non-Disclosed  3.346000              15

In [57]:
total_purchase_value=pd.DataFrame(groupby_purchase_data_df["Price"].sum())
new_groupby_purchase_data_df["Total Purchase Value"]=total_purchase_value
new_groupby_purchase_data_df

                          Price  Purchase Count  Total Purchase Value
Gender
Female                 3.203009             113                361.94
Male                   3.017853             652               1967.64
Other / Non-Disclosed  3.346000              15                 50.19

In [58]:
new_groupby_purchase_data_df[["Purchase Count", "Price", "Total Purchase Value"]]

                       Purchase Count     Price  Total Purchase Value
Gender
Female                            113  3.203009                361.94
Male                              652  3.017853               1967.64
Other / Non-Disclosed              15  3.346000                 50.19

In [59]:
new_groupby_purchase_data_df.rename(columns={"Price": "Average Purchase Price"})

,Average Purchase Price,Purchase Count,Total Purchase Value
Gender,,,
Female,3.203009,113,361.94
Male,3.017853,652,1967.64
Other / Non-Disclosed,3.346000,15,50.19

In [60]:
groupby_gender_and_sn_df=purchase_data.groupby(["Gender","SN"])

In [80]:
groupby_gender_and_sn_df.mean()

                                     Purchase ID   Age  Item ID  Price
Gender                SN
Female                Adastirin33          142.0  35.0    175.0  4.480
                      Aerithllora36        426.0  29.0    117.5  4.320
                      Aethedru70           775.0  21.0     60.0  3.540
                      Aidain51             516.0  39.0     35.0  3.450
                      Aiduesu86            429.0  22.0    179.0  4.480
...                                          ...   ...      ...    ...
Other / Non-Disclosed Lirtim36             401.0  15.0     46.0  1.330
                      Maluncil97           589.0  25.0    126.5  2.640
                      Rairith81            350.0  15.0     34.0  2.220
                      Siarithria38         384.5  38.0     85.0  3.455
                      Sundim98             111.0  21.0     41.0  4.750

[576 rows x 4 columns]

In [73]:
avg_purchase_person=pd.DataFrame(groupby_gender_and_sn_df["Price"].sum())

In [74]:
avg_purchase_person.mean()

Price    4.131545
dtype: float64

In [75]:
avg_purchase_person["Avg Total Purchase per Person"]=avg_purchase_person

In [76]:
avg_purchase_person

                                     Price  Avg Total Purchase per Person
Gender                SN
Female                Adastirin33     4.48                           4.48
                      Aerithllora36   8.64                           8.64
                      Aethedru70      3.54                           3.54
                      Aidain51        3.45                           3.45
                      Aiduesu86       4.48                           4.48
...                                    ...                            ...
Other / Non-Disclosed Lirtim36        1.33                           1.33
                      Maluncil97      5.28                           5.28
                      Rairith81       2.22                           2.22
                      Siarithria38    6.91                           6.91
                      Sundim98        4.75                           4.75

[576 rows x 2 columns]

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame